Repository: Richard-JHLee/DNAViewer
Catalog: Sources/Resources/*.lproj/Localizable.strings
Languages: de, ja, ko

# app_subtitle
source: Genetic Explorer
de: Genetischer Explorer
ja: 遺伝子エクスプローラー
ko: 유전자 탐색기

# menu_about
source: About
de: Über
ja: アプリについて
ko: 앱 정보

# menu_about_subtitle
source: App information and version
de: App-Informationen und Version
ja: アプリ情報とバージョン
ko: 앱 정보 및 버전

# menu_user_guide
source: User Guide
de: Benutzerhandbuch
ja: ユーザーガイド
ko: 사용 가이드

# menu_user_guide_subtitle
source: Learn how to use DNA Viewer
de: Erfahren Sie, wie Sie DNA Viewer verwenden
ja: DNA Viewerの使い方を学ぶ
ko: DNA Viewer 사용법 학습

# menu_features
source: Features
de: Funktionen
ja: 主な機能
ko: 주요 기능

# menu_features_subtitle
source: Key features and capabilities
de: Hauptfunktionen und -fähigkeiten
ja: 主な機能と特徴
ko: 핵심 기능과 특징

# menu_help
source: Help & FAQ
de: Hilfe & FAQ
ja: ヘルプ & FAQ
ko: 도움말 & FAQ

# menu_help_subtitle
source: Common questions and troubleshooting
de: Häufige Fragen und Fehlerbehebung
ja: よくある質問とトラブルシューティング
ko: 자주 묻는 질문과 문제 해결

# menu_settings
source: Settings
de: Einstellungen
ja: 設定
ko: 설정

# menu_settings_subtitle
source: App preferences and configuration
de: App-Einstellungen und -Konfiguration
ja: アプリの設定
ko: 앱 환경설정

# menu_privacy
source: Privacy Policy
de: Datenschutz
ja: プライバシーポリシー
ko: 개인정보 처리방침

# menu_privacy_subtitle
source: Data protection and privacy
de: Datenschutz und Privatsphäre
ja: データ保護とプライバシー
ko: 데이터 보호 및 개인정보

# menu_terms
source: Terms of Service
de: Nutzungsbedingungen
ja: 利用規約
ko: 이용약관

# menu_terms_subtitle
source: Usage terms and conditions
de: Nutzungsbedingungen und -konditionen
ja: 利用規約と条件
ko: 사용 약관 및 조건

# menu_license
source: License
de: Lizenz
ja: ライセンス
ko: 라이센스

# menu_license_subtitle
source: MIT License and open source
de: MIT-Lizenz und Open Source
ja: MITライセンスとオープンソース
ko: MIT 라이센스 및 오픈소스

# about_title
source: About DNA Viewer
de: Über DNA Viewer
ja: DNA Viewerについて
ko: DNA Viewer 소개

# about_description
source: DNA Viewer is a 3D DNA structure visualization app for genetics education. It integrates with the NCBI database to download real gene data and explore DNA structures in an interactive 3D environment. It provides various analysis tools such as restriction enzyme analysis, protein translation, and GC content analysis to support molecular biology learning.
de: DNA Viewer ist eine 3D-DNA-Strukturvisualisierungs-App für die Genetikausbildung. Sie integriert sich mit der NCBI-Datenbank, um echte Gendaten herunterzuladen und DNA-Strukturen in einer interaktiven 3D-Umgebung zu erkunden. Sie bietet verschiedene Analysetools wie Restriktionsenzymanalyse, Proteinübersetzung und GC-Gehaltsanalyse zur Unterstützung des Molekularbiologieunterrichts.
ja: DNA Viewerは遺伝学教育のための3D DNA構造可視化アプリです。NCBIデータベースと連携して実際の遺伝子データをダウンロードし、インタラクティブな3D環境でDNA構造を探索できます。制限酵素分析、タンパク質翻訳、GC含量分析など、さまざまな分析ツールを提供して分子生物学の学習を支援します。
ko: DNA Viewer는 유전학 교육을 위한 3D DNA 구조 시각화 앱입니다. NCBI 데이터베이스와 연동하여 실제 유전자 데이터를 다운로드하고, 인터랙티브한 3D 환경에서 DNA 구조를 탐색할 수 있습니다. 제한 효소 분석, 단백질 번역, GC 함량 분석 등 다양한 분석 도구를 제공하여 분자생물학 학습을 돕습니다.

# about_developer
source: Developer
de: Entwickler
ja: 開発者
ko: 개발자

# about_copyright
source: © 2025 AVAS. All rights reserved.
de: © 2025 AVAS. Alle Rechte vorbehalten.
ko: © 2025 AVAS. 모든 권리 보유.

# about_tech_stack
source: Technology Stack
de: Technologie-Stack
ja: 技術スタック
ko: 기술 스택

# about_key_features
source: Key Features
de: Hauptfunktionen
ja: 主な機能
ko: 주요 기능

# about_feature_3d_title
source: 3D DNA Visualization
ja: 3D DNA可視化
ko: 3D DNA 시각화

# about_feature_3d_desc
source: High-quality 3D rendering with SceneKit supporting Double Helix, Ladder, Ball & Stick styles
ja: SceneKitによる高品質3Dレンダリング、Double Helix、Ladder、Ball & Stickスタイルをサポート
ko: SceneKit 기반 고품질 3D 렌더링으로 Double Helix, Ladder, Ball & Stick 스타일 지원

# about_feature_ncbi_title
source: NCBI Gene Library
ja: NCBI遺伝子ライブラリ
ko: NCBI 유전자 라이브러리

# about_feature_ncbi_desc
source: Real-time NCBI database integration providing thousands of gene information
ja: リアルタイムNCBIデータベース連携で数千の遺伝子情報を提供
ko: 실시간 NCBI 데이터베이스 연동으로 수천 개의 유전자 정보 제공

# about_feature_analysis_title
source: Advanced Analysis Tools
ja: 高度な分析ツール
ko: 고급 분석 도구

# about_feature_analysis_desc
source: Comprehensive analysis including GC content, CpG islands, restriction enzymes, protein translation
ja: GC含量、CpGアイランド、制限酵素、タンパク質翻訳を含む包括的な分析
ko: GC 함량, CpG 아일랜드, 제한 효소, 단백질 번역 등 포괄적인 분석

# about_feature_enzyme_title
source: Restriction Enzyme Simulation
ja: 制限酵素シミュレーション
ko: 제한 효소 시뮬레이션

# about_feature_enzyme_desc
source: Visualize DNA cutting positions and virtual experiments with 200+ restriction enzymes
ja: 200+制限酵素でDNA切断位置の可視化と仮想実験
ko: 200+ 제한 효소로 DNA 절단 위치 시각화 및 가상 실험

# about_feature_color_title
source: Color Themes
ja: カラーテーマ
ko: 색상 테마

# about_feature_color_desc
source: Various color themes including Classic, Vivid, Pastel, Neon with customization
ja: Classic、Vivid、Pastel、Neonなど様々なカラーテーマとカスタマイズ
ko: Classic, Vivid, Pastel, Neon 등 다양한 색상 테마와 커스터마이징

# about_feature_interact_title
source: Interactive Control
ja: インタラクティブ操作
ko: 인터랙티브 조작

# about_feature_interact_desc
source: Intuitive 3D manipulation with drag, pinch, auto-rotation
ja: ドラッグ、ピンチ、自動回転による直感的な3D操作
ko: 드래그, 핀치, 자동 회전 등 직관적인 3D 조작

# about_feature_edu_title
source: Educational Features
ja: 教育機能
ko: 교육적 기능

# about_feature_edu_desc
source: Molecular biology experiment simulation and cloning process visualization
ja: 分子生物学実験シミュレーションとクローニングプロセス可視化
ko: 분자생물학 실험 시뮬레이션과 클로닝 프로세스 시각화

# guide_title
source: User Guide
de: Benutzerhandbuch
ja: ユーザーガイド
ko: 사용 가이드

# guide_subtitle
source: Complete guide for DNA sequence analysis and 3D visualization
de: Vollständiger Leitfaden für DNA-Sequenzanalyse und 3D-Visualisierung
ja: DNA配列分析と3D可視化のための完全なガイド
ko: DNA 시퀀스 분석과 3D 시각화를 위한 완전한 가이드

# guide_getting_started
source: 🚀 Getting Started
de: Erste Schritte
ja: はじめに
ko: 🚀 시작하기

# guide_gene_library
source: 📚 Gene Library
de: Genbibliothek
ja: 遺伝子ライブラリ
ko: 📚 유전자 라이브러리

# guide_analysis_tools
source: 📊 Analysis Tools
de: Analysewerkzeuge
ja: 分析ツール
ko: 📊 분석 도구

# guide_restriction_enzymes
source: ✂️ Restriction Enzymes
de: Restriktionsenzyme
ja: 制限酵素
ko: ✂️ 제한 효소

# guide_start_1_title
source: View Basic DNA Sequence
ko: 기본 DNA 시퀀스 보기

# guide_start_1_desc
source: Default DNA sequence (BRCA1) loads on start. Drag to rotate, pinch to zoom.
ko: 앱 시작 시 기본 DNA 시퀀스(BRCA1)가 로드됩니다. 드래그로 회전, 핀치로 확대/축소하세요.

# guide_start_2_title
source: Group Navigation
ko: 그룹별 탐색

# guide_start_2_desc
source: DNA is grouped in 100bp units. Move between sections using G1, G2, G3... buttons.
ko: DNA는 100bp 단위로 그룹화됩니다. G1, G2, G3... 버튼으로 섹션을 이동하세요.

# guide_start_3_title
source: Read Sequence
ko: 시퀀스 읽기

# guide_start_3_desc
source: 'Sequence' button displays nucleotide bases (A, T, G, C) at the bottom.
ko: 'Sequence' 버튼으로 하단에 염기서열(A, T, G, C)을 표시합니다.

# guide_start_4_title
source: Change 3D Style
ko: 3D 스타일 변경

# guide_start_4_desc
source: Tap eye icon (👁) to select various 3D modes like Double Helix, Ladder, Ball & Stick.
ko: 눈 아이콘(👁)으로 Double Helix, Ladder, Ball & Stick 등 다양한 3D 모드를 선택하세요.

# guide_lib_1_title
source: Open Library
ko: 라이브러리 열기

# guide_lib_1_desc
source: Menu(☰) → Gene Library to explore genes from NCBI database.
ko: 메뉴(☰) → Gene Library로 NCBI 데이터베이스의 유전자를 탐색하세요.

# guide_lib_2_title
source: Category Search
ko: 카테고리별 검색

# guide_lib_2_desc
source: Filter by Organism, Gene Type, Chromosome, Status, Gene Family.
ko: Organism, Gene Type, Chromosome, Status, Gene Family로 필터링하세요.

# guide_lib_3_title
source: Apply Gene
ko: 유전자 적용

# guide_lib_3_desc
source: Select gene and tap 'Apply' to load DNA sequence in 3D.
ko: 유전자 선택 후 'Apply'로 해당 DNA 시퀀스를 3D로 로드합니다.

# guide_lib_4_title
source: Real-time Data
ko: 실시간 데이터

# guide_lib_4_desc
source: All data is fetched real-time from NCBI, always up-to-date.
ko: 모든 데이터는 NCBI에서 실시간으로 가져오므로 항상 최신입니다.

# guide_analysis_1_title
source: GC Content
ko: GC 함량

# guide_analysis_1_desc
source: Analyze ratio of Guanine(G) and Cytosine(C) bases. High GC content means more stable DNA structure.
ko: 구아닌(G)과 시토신(C) 염기의 비율을 분석합니다. 높은 GC 함량은 안정적인 DNA를 의미합니다.

# guide_analysis_2_title
source: CpG Islands
ko: CpG 아일랜드

# guide_analysis_2_desc
source: Detect regions with high CG dinucleotide frequency. Important for gene regulation.
ko: CG 빈도가 높은 영역을 탐지합니다. 유전자 조절에 중요한 역할을 합니다.

# guide_analysis_3_title
source: Restriction Enzymes
ko: 제한 효소

# guide_analysis_3_desc
source: Analyze enzymes that can cut DNA and check cutting positions.
ko: DNA 절단 가능한 효소들을 분석하고 절단 위치를 확인합니다.

# guide_analysis_4_title
source: Protein Translation
ko: 단백질 번역

# guide_analysis_4_desc
source: Translate DNA to amino acids, find ORFs, analyze amino acid composition.
ko: DNA를 아미노산으로 번역하고, ORF를 찾고, 아미노산 조성을 분석합니다.

# guide_enzyme_1_title
source: Select Enzymes
ko: 효소 선택

# guide_enzyme_1_desc
source: Tap Scissor button to check available restriction enzymes for current sequence.
ko: Scissor 버튼으로 현재 시퀀스에 사용 가능한 제한 효소 목록을 확인하세요.

# guide_enzyme_2_title
source: 3D Visualization
ko: 3D 시각화

# guide_enzyme_2_desc
source: 'Show 3D' displays cutting positions with red markers in 3D.
ko: 'Show 3D'로 절단 위치를 3D에서 빨간 마커로 표시합니다.

# guide_enzyme_3_title
source: Virtual Digestion
ko: 가상 절단

# guide_enzyme_3_desc
source: 'Digest' button simulates DNA cutting and shows fragments.
ko: 'Digest' 버튼으로 DNA 절단을 시뮬레이션하고 단편을 확인하세요.

# guide_enzyme_4_title
source: Educational Use
ko: 교육적 활용

# guide_enzyme_4_desc
source: Learn recognition sequences and cutting patterns of each enzyme.
ko: 각 효소의 인식 서열과 절단 패턴을 학습할 수 있습니다.

# guide_tip_1_title
source: Rotation
ko: 회전

# guide_tip_1_desc
source: Drag 3D view to freely rotate DNA structure.
ko: 3D 뷰를 드래그하여 DNA 구조를 자유롭게 회전시키세요.

# guide_tip_2_title
source: Zoom
ko: 확대/축소

# guide_tip_2_desc
source: Use pinch gesture to zoom in/out 3D structure.
ko: 핀치 제스처로 3D 구조를 확대하거나 축소하세요.

# guide_tip_3_title
source: Auto Rotation
ko: 자동 회전

# guide_tip_3_desc
source: Rotation button makes DNA rotate 360 degrees automatically.
ko: Rotation 버튼으로 DNA를 360도 자동 회전시킵니다.

# guide_tip_4_title
source: Reset View
ko: 뷰 초기화

# guide_tip_4_desc
source: Reload button resets camera to default position.
ko: Reload 버튼으로 카메라를 기본 위치로 재설정합니다.

# features_title
source: Features
de: Hauptfunktionen
ja: 主な機能
ko: 주요 기능

# features_3d_viz_desc_1
source: High-quality 3D rendering based on SceneKit
ko: SceneKit 기반 고품질 3D 렌더링

# features_3d_viz_desc_2
source: Real-time interactive manipulation (rotation, zoom)
ko: 실시간 인터랙티브 조작 (회전, 확대/축소)

# features_3d_viz_desc_3
source: Support for Double Helix, Ladder, Ball & Stick styles
ko: Double Helix, Ladder, Ball & Stick 스타일 지원

# features_3d_viz_desc_4
source: Group-based sequence exploration (100bp units)
ko: 그룹별 염기서열 탐색 (100bp 단위)

# features_gene_lib_desc_1
source: Real-time NCBI database integration
ko: NCBI 데이터베이스 실시간 연동

# features_gene_lib_desc_2
source: Category-based gene search and filtering
ko: 카테고리별 유전자 검색 및 필터링

# features_gene_lib_desc_3
source: Classification by Organism, Gene Type, Chromosome
ko: Organism, Gene Type, Chromosome 등 분류

# features_gene_lib_desc_4
source: Automatic FASTA format DNA sequence loading
ko: FASTA 형식 DNA 시퀀스 자동 로드

# features_analysis_desc_1
source: GC content analysis and window plot
ko: GC 함량 분석 및 윈도우 플롯

# features_analysis_desc_2
source: Automatic CpG island detection
ko: CpG 아일랜드 자동 탐지

# features_analysis_desc_3
source: Restriction enzyme cutting site analysis
ko: 제한 효소 절단 부위 분석

# features_analysis_desc_4
source: DNA → Protein translation (codon table)
ko: DNA → 단백질 번역 (코돈 테이블)

# features_analysis_desc_5
source: Amino acid composition bar chart
ko: 아미노산 조성 막대그래프

# features_analysis_desc_6
source: Open Reading Frame (ORF) detection
ko: Open Reading Frame (ORF) 탐지

# features_enzyme_desc_1
source: 200+ restriction enzyme database
ko: 200+ 제한 효소 데이터베이스

# features_enzyme_desc_2
source: IUPAC code support (regex conversion)
ko: IUPAC 코드 지원 (정규표현식 변환)

# features_enzyme_desc_3
source: 3D visualization of cutting positions (red markers)
ko: 절단 위치 3D 시각화 (빨간 마커)

# features_enzyme_desc_4
source: SequenceBar scissors icon display
ko: SequenceBar scissors 아이콘 표시

# features_enzyme_desc_5
source: Virtual DNA digestion simulation
ko: 가상 DNA 절단 시뮬레이션

# features_enzyme_desc_6
source: Educational Gel Electrophoresis visualization
ko: 교육용 Gel Electrophoresis 시각화

# features_color_desc_1
source: Classic, Vivid, Pastel, Neon themes
ko: Classic, Vivid, Pastel, Neon 테마

# features_color_desc_2
source: Base-specific color customization (A, T, G, C)
ko: 염기별 색상 커스터마이징 (A, T, G, C)

# features_color_desc_3
source: Hydrogen bond color settings
ko: 수소 결합 색상 설정

# features_color_desc_4
source: Real-time color change and preview
ko: 실시간 색상 변경 및 미리보기

# features_interact_desc_1
source: Drag to rotate 3D model
ko: 드래그로 3D 모델 회전

# features_interact_desc_2
source: Pinch gesture to zoom
ko: 핀치 제스처로 확대/축소

# features_interact_desc_3
source: Auto 360-degree rotation animation
ko: 자동 360도 회전 애니메이션

# features_interact_desc_4
source: Individual base selection and highlight
ko: 개별 염기 선택 및 하이라이트

# features_interact_desc_5
source: Group-based navigation
ko: 그룹 단위 네비게이션

# features_interact_desc_6
source: Reload to restore initial state
ko: Reload로 초기 상태 복원

# features_perf_desc_1
source: Memory efficiency through group-based loading
ko: 그룹 단위 로딩으로 메모리 효율화

# features_perf_desc_2
source: Large DNA sequence processing capability
ko: 대용량 DNA 시퀀스 처리 가능

# features_perf_desc_3
source: Background thread 3D rendering
ko: 백그라운드 스레드 3D 렌더링

# features_perf_desc_4
source: Smart caching system
ko: 스마트 캐싱 시스템

# features_perf_desc_5
source: Automatic memory cleanup (autoreleasepool)
ko: 자동 메모리 정리 (autoreleasepool)

# features_edu_desc_1
source: Molecular biology experiment simulation
ko: 분자생물학 실험 시뮬레이션

# features_edu_desc_2
source: DNA cloning process visualization
ko: DNA 클로닝 프로세스 시각화

# features_edu_desc_3
source: Gene transformation animation
ko: 유전자 변환 애니메이션

# features_edu_desc_4
source: Experimental verification process learning
ko: 실험 검증 과정 학습

# features_edu_desc_5
source: Detailed user guide provided
ko: 상세한 사용 가이드 제공

# help_need_more
source: Need Additional Help
de: Benötigen Sie weitere Hilfe
ja: 追加のヘルプが必要です
ko: 추가 도움이 필요합니다

# help_contact_info
source: If problems persist or you have other questions, please contact us through the contact information on the app info page.
de: Wenn Probleme weiterhin bestehen oder Sie weitere Fragen haben, kontaktieren Sie uns bitte über die Kontaktinformationen auf der App-Info-Seite.
ja: 問題が続く場合や他の質問がある場合は、アプリ情報ページのお問い合わせ情報からご連絡ください。
ko: 문제가 지속되거나 다른 질문이 있으시면 앱 정보 페이지의 문의 정보를 통해 연락해주세요.

# help_general_q1
source: How to load DNA sequence?
ko: DNA 시퀀스를 어떻게 로드하나요?

# help_general_a1
source: Menu(☰) → Gene Library, select desired gene, then tap 'Apply' button. Data is fetched real-time from NCBI database.
ko: 메뉴(☰)에서 Gene Library를 선택하고 원하는 유전자를 검색한 후 'Apply' 버튼을 누르세요. NCBI 데이터베이스에서 실시간으로 데이터를 가져옵니다.

# help_general_q2
source: App runs slowly
ko: 앱이 느리게 실행됩니다

# help_general_a2
source: Large DNA sequences may take longer to load. Groups are divided into 100bp units, please wait briefly when switching groups.
ko: 대용량 DNA 시퀀스의 경우 로딩 시간이 오래 걸릴 수 있습니다. 그룹 단위(100bp)로 나누어 표시하므로 각 그룹 전환 시 잠시 기다려주세요.

# help_general_q3
source: Where to check sequence info?
ko: 시퀀스 정보는 어디서 확인하나요?

# help_general_a3
source: Tap Info button(ℹ️) at the top to view detailed information (name, length, chromosome, organism, etc.) of current DNA sequence.
ko: 상단의 Info 버튼(ℹ️)을 누르면 현재 DNA 시퀀스의 상세 정보(이름, 길이, 염색체, 생물체 등)를 확인할 수 있습니다.

# help_3d_q1
source: 3D view doesn't move
ko: 3D 뷰가 움직이지 않아요

# help_3d_a1
source: Use drag gesture to rotate, pinch gesture to zoom. Reload button(↻) returns to initial state.
ko: 드래그 제스처로 회전, 핀치 제스처로 확대/축소하세요. Reload 버튼(↻)으로 초기 상태로 되돌릴 수 있습니다.

# help_3d_q2
source: How to change 3D style?
ko: 3D 스타일을 변경하려면?

# help_3d_a2
source: Tap eye icon(👁) button to show Style section. Choose from Double Helix, Ladder, Ball & Stick.
ko: 눈 아이콘(👁) 버튼을 누르면 Style 섹션이 나타납니다. Double Helix, Ladder, Ball & Stick 중 원하는 스타일을 선택하세요.

# help_3d_q3
source: Colors don't change
ko: 색상이 변경되지 않습니다

# help_3d_a3
source: Tap eye icon(👁) button and select desired color theme from Color section. Various themes like Classic, Vivid, Pastel, Neon available.
ko: 눈 아이콘(👁) 버튼을 누르고 Color 섹션에서 원하는 색상 테마를 선택하세요. Classic, Vivid, Pastel, Neon 등 다양한 테마가 있습니다.

# help_3d_q4
source: How to auto-rotate?
ko: 자동 회전은 어떻게 하나요?

# help_3d_a4
source: Tap Rotation button in bottom menu to rotate DNA 360 degrees automatically. Tap again to stop.
ko: Bottom menu에서 Rotation 버튼을 누르면 DNA가 360도 자동으로 회전합니다. 다시 누르면 정지합니다.

# help_analysis_q1
source: What is GC content?
ko: GC 함량이란 무엇인가요?

# help_analysis_a1
source: Ratio of Guanine(G) and Cytosine(C) bases. High GC content means more stable DNA structure, important for gene expression and evolution research.
ko: 구아닌(G)과 시토신(C) 염기의 비율입니다. 높은 GC 함량은 더 안정적인 DNA 구조를 의미하며, 유전자 발현과 진화 연구에 중요합니다.

# help_analysis_q2
source: Why are CpG islands important?
ko: CpG 아일랜드는 왜 중요한가요?

# help_analysis_a2
source: CpG islands are regions rich in CG dinucleotides, often located in gene promoter regions. They play key role in gene regulation through DNA methylation.
ko: CpG 아일랜드는 CG 디뉴클레오티드가 풍부한 영역으로, 유전자의 프로모터 부위에 많이 위치합니다. DNA 메틸화를 통한 유전자 조절에 핵심적인 역할을 합니다.

# help_analysis_q3
source: How to view protein translation results?
ko: 단백질 번역 결과는 어떻게 보나요?

# help_analysis_a3
source: Select 'Protein' tab in Analysis menu. DNA automatically translates to amino acids, showing detailed codon info and ORF (Open Reading Frame).
ko: Analysis 메뉴에서 'Protein' 탭을 선택하세요. DNA가 자동으로 아미노산으로 번역되며, 코돈별 상세 정보와 ORF(Open Reading Frame)를 확인할 수 있습니다.

# help_analysis_q4
source: What is amino acid composition graph?
ko: 아미노산 조성 그래프는 무엇인가요?

# help_analysis_a4
source: Bar graph showing count and ratio of each amino acid in translated protein. Colors indicate chemical properties (hydrophobic, polar, charge).
ko: 번역된 단백질에 포함된 각 아미노산의 개수와 비율을 막대그래프로 보여줍니다. 색상은 아미노산의 화학적 특성(소수성, 극성, 전하)을 나타냅니다.

# help_enzyme_q1
source: Enzyme cut sites don't appear
ko: 제한 효소 절단 위치가 안 보여요

# help_enzyme_a1
source: Tap Scissor button in bottom menu, select desired restriction enzyme, then tap 'Show 3D' button. Red markers will appear in 3D view.
ko: Bottom menu의 Scissor 버튼을 누르고, 원하는 제한 효소를 선택한 후 'Show 3D' 버튼을 눌러주세요. 3D 뷰에 빨간색 마커가 표시됩니다.

# help_enzyme_q2
source: Can I select multiple enzymes?
ko: 여러 효소를 동시에 선택할 수 있나요?

# help_enzyme_a2
source: Yes! All cutting positions will be displayed together when multiple restriction enzymes are selected. Virtual cutting simulation also available with 'Digest' button.
ko: 네! 여러 제한 효소를 선택하면 모든 절단 위치가 함께 표시됩니다. 'Digest' 버튼으로 가상 절단 시뮬레이션도 가능합니다.

# help_enzyme_q3
source: How to remove cutting markers?
ko: 절단 마커를 제거하려면?

# help_enzyme_a3
source: Tap Reload button(↻) in bottom menu to remove all highlights and markers, returning to initial state.
ko: Bottom menu의 Reload 버튼(↻)을 누르면 모든 하이라이트와 마커가 제거되고 초기 상태로 돌아갑니다.

# help_enzyme_q4
source: Scissors icon appears in SequenceBar
ko: SequenceBar에 scissors 아이콘이 나타납니다

# help_enzyme_a4
source: This indicates that position is a restriction enzyme cutting site. Displayed with red border for easy identification of exact cutting position.
ko: 이것은 해당 위치가 제한 효소 절단 위치임을 나타냅니다. 빨간색 테두리와 함께 표시되어 정확한 절단 위치를 쉽게 확인할 수 있습니다.

# help_trouble_q1
source: App freezes or doesn't respond
ko: 앱이 멈추거나 응답하지 않습니다

# help_trouble_a1
source: Very large DNA sequences may take time for 3D rendering. Try Reload button or restart the app.
ko: 매우 큰 DNA 시퀀스의 경우 3D 렌더링에 시간이 걸릴 수 있습니다. Reload 버튼을 눌러 초기화하거나, 앱을 재시작해보세요.

# help_trouble_q2
source: Can't find gene in Gene Library
ko: Gene Library에서 유전자를 찾을 수 없어요

# help_trouble_a2
source: Check internet connection and ensure correct gene name or symbol. Only genes registered in NCBI database are searchable.
ko: 인터넷 연결을 확인하고, 정확한 유전자 이름이나 심볼을 입력했는지 확인하세요. NCBI 데이터베이스에 등록된 유전자만 검색 가능합니다.

# help_trouble_q3
source: Can I save analysis results?
ko: 분석 결과를 저장할 수 있나요?

# help_trouble_a3
source: Current version supports saving analysis results via screenshot. Data export feature will be added in future updates.
ko: 현재 버전에서는 화면 캡처(스크린샷)로 분석 결과를 저장할 수 있습니다. 향후 업데이트에서 데이터 내보내기 기능이 추가될 예정입니다.

# privacy_section_1_title
source: 1. Information Collection
ja: 1. 情報収集
ko: 1. 수집하는 정보

# privacy_section_1_content
source: DNA Viewer does not collect personal information. • Gene ID: Public identifier for downloading gene data, not personal information. • App usage data: All data generated within app is stored only on device. • Network requests: Only API calls for downloading DNA sequence data.
ja: DNA Viewerは個人情報を収集しません。 • 遺伝子ID：遺伝子データダウンロード用の公開識別子で、個人情報ではありません。 • アプリ使用データ：アプリ内で生成されたすべてのデータはデバイス上にのみ保存されます。 • ネットワークリクエスト：DNA配列データダウンロード用のAPIコールのみです。
ko: DNA Viewer는 사용자의 개인정보를 수집하지 않습니다. • Gene ID: 유전자 데이터를 다운로드하기 위한 공개 식별자로, 개인정보가 아닙니다. • 앱 사용 데이터: 앱 내에서 생성되는 모든 데이터는 기기에만 저장됩니다. • 네트워크 요청: DNA 시퀀스 데이터 다운로드를 위한 API 호출만 수행합니다.

# privacy_section_2_title
source: 2. Information Usage Purpose
ja: 2. 情報使用目的
ko: 2. 정보 사용 목적

# privacy_section_2_content
source: • DNA structure visualization and 3D rendering • Data provision for educational and research purposes • Local data processing for app improvement • In-app features for user experience enhancement
ja: • DNA構造可視化と3Dレンダリング • 教育・研究目的のデータ提供 • アプリ改善のためのローカルデータ処理 • ユーザー体験向上のためのアプリ内機能
ko: • DNA 구조 시각화 및 3D 렌더링 • 교육 및 연구 목적의 데이터 제공 • 앱 기능 향상을 위한 로컬 데이터 처리 • 사용자 경험 개선을 위한 앱 내 기능 제공

# privacy_section_3_title
source: 3. Information Protection and Security
ja: 3. 情報保護とセキュリティ
ko: 3. 정보 보호 및 보안

# privacy_section_3_content
source: • All data stored only on user device. • No personal information transmitted to external servers. • Only public data requested during NCBI API calls. • All local data deleted when app is removed.
ja: • すべてのデータはユーザーのデバイス上にのみ保存されます。 • 外部サーバーへの個人情報送信はありません。 • NCBI APIコール時に公開データのみをリクエストします。 • アプリを削除すると、すべてのローカルデータが削除されます。
ko: • 모든 데이터는 사용자 기기에만 저장됩니다. • 외부 서버로 개인정보가 전송되지 않습니다. • NCBI API 호출 시에는 공개 데이터만 요청합니다. • 앱 삭제 시 모든 로컬 데이터가 함께 삭제됩니다.

# privacy_section_4_title
source: 4. Third-Party Services
ja: 4. サードパーティサービス
ko: 4. 제3자 서비스

# privacy_section_4_content
source: • NCBI E-utilities (eutils.ncbi.nlm.nih.gov): Gene data provider • NCBI Gene Database: Gene information provider • NCBI Nucleotide Database: DNA sequence provider All services are public APIs and do not require personal information.
ja: • NCBI E-utilities (eutils.ncbi.nlm.nih.gov)：遺伝子データプロバイダー • NCBI遺伝子データベース：遺伝子情報プロバイダー • NCBIヌクレオチドデータベース：DNA配列プロバイダー すべてのサービスは公開APIで、個人情報は必要ありません。
ko: • NCBI E-utilities (eutils.ncbi.nlm.nih.gov): 유전자 데이터 제공 • NCBI Gene Database: 유전자 정보 제공 • NCBI Nucleotide Database: DNA 시퀀스 제공 이들 서비스는 모두 공개 API이며 개인정보를 요구하지 않습니다.

# privacy_section_5_title
source: 5. User Rights
ja: 5. ユーザーの権利
ko: 5. 사용자 권리

# privacy_section_5_content
source: • Data deletion: Delete all data by removing app. • Data modification: Information entered in app can be modified anytime. • Inquiries: Use app info page for privacy-related inquiries.
ja: • データ削除：アプリを削除することですべてのデータを削除できます。 • データ修正：アプリで入力した情報はいつでも修正できます。 • お問い合わせ：プライバシー関連のお問い合わせはアプリ情報ページをご利用ください。
ko: • 데이터 삭제: 앱 삭제를 통해 모든 데이터를 삭제할 수 있습니다. • 데이터 수정: 앱 내에서 입력한 정보는 언제든 수정 가능합니다. • 문의: 개인정보 관련 문의는 앱 정보 페이지를 이용해주세요.

# privacy_section_6_title
source: 6. Policy Changes
ja: 6. ポリシーの変更
ko: 6. 정책 변경

# privacy_section_6_content
source: Privacy policy may change as needed, with notifications in app when changed. Last updated: October 20, 2025
ja: プライバシーポリシーは必要に応じて変更される場合があり、変更時はアプリ内で通知されます。最終更新日：2025年10月20日
ko: 개인정보 처리방침은 필요에 따라 변경될 수 있으며, 변경 시 앱 내에서 공지합니다. 마지막 업데이트: 2025년 10월 20일

# terms_section_1_title
source: Service Usage
ja: サービス利用
ko: 서비스 이용

# terms_section_1_content
source: DNA Viewer is a paid app. Payment through the App Store is required to download and use the app.
ja: DNA Viewerは有料アプリです。アプリのダウンロードと使用にはApp Storeでの決済が必要です。
ko: DNA Viewer는 유료 앱입니다. 앱 다운로드 및 사용을 위해서는 App Store에서 결제가 필요합니다.

# terms_section_2_title
source: Payment & Subscription
ja: 支払いとサブスクリプション
ko: 결제 및 구독
