Repository: Richard-JHLee/DNAViewer
Catalog: Sources/Resources/*.lproj/Localizable.strings
Languages: de, ja, ko

# terms_section_2_content
source: • App purchases are processed through the App Store. • One-time payment provides access to all app features. • No additional payments after app purchase. • Refunds are limited according to App Store policy.
ja: • アプリの購入はApp Storeを通じて処理されます。 • 一回の支払いですべての機能を利用できます。 • アプリ購入後の追加支払いはありません。 • 返金はApp Storeのポリシーに従って制限されます。
ko: • 앱 구매는 App Store를 통해 처리됩니다. • 일회성 결제로 앱의 모든 기능을 이용할 수 있습니다. • 앱 구매 후 추가 결제는 없습니다. • 환불은 App Store 정책에 따라 제한적입니다.

# terms_section_3_title
source: Service Scope
ja: サービス範囲
ko: 서비스 범위

# terms_section_3_content
source: • 3D DNA structure visualization • NCBI gene library access • Advanced analysis tools (GC content, CpG islands, restriction enzymes) • Protein translation and ORF detection • Offline data storage • Customer support service • All features included with app purchase.
ja: • 3D DNA構造可視化 • NCBI遺伝子ライブラリアクセス • 高度な分析ツール（GC含量、CpGアイランド、制限酵素） • タンパク質翻訳とORF検出 • オフラインデータ保存 • カスタマーサポートサービス • アプリ購入ですべての機能が含まれます。
ko: • 3D DNA 구조 시각화 • NCBI 유전자 라이브러리 접근 • 고급 분석 도구 (GC 함량, CpG 아일랜드, 제한 효소) • 단백질 번역 및 ORF 탐지 • 오프라인 데이터 저장 • 고객 지원 서비스 • 모든 기능이 앱 구매 시 포함됩니다.

# terms_section_4_title
source: Refund Policy
ja: 返金ポリシー
ko: 환불 정책

# terms_section_4_content
source: • App purchase refunds processed according to Apple App Store policy. • Please request refunds directly through App Store. • Apple's refund policy: https://support.apple.com/HT204084 • Developers have no refund processing authority; Apple manages all refunds.
ja: • アプリ購入の返金はApple App Storeのポリシーに従って処理されます。 • 返金はApp Storeから直接リクエストしてください。 • Appleの返金ポリシー：https://support.apple.com/HT204084 • 開発者には返金処理権限がありません。すべての返金はAppleが管理します。
ko: • 앱 구매 환불은 Apple App Store 정책에 따라 처리됩니다. • 환불 요청은 App Store에서 직접 신청해주세요. • Apple의 환불 정책: https://support.apple.com/HT204084 • 개발자는 환불 처리 권한이 없으며, Apple이 모든 환불을 관리합니다.

# terms_section_5_title
source: User Responsibility
ja: ユーザーの責任
ko: 사용자 책임

# terms_section_5_content
source: • Use app for educational and research purposes only. • Use NCBI data for academic and non-commercial purposes only. • Users must verify accuracy of information obtained through app. • Important research or medical decisions require expert review.
ja: • アプリは教育・研究目的のみに使用してください。 • NCBIデータは学術的かつ非商業的目的のみに使用してください。 • アプリから取得した情報の正確性はユーザーが確認する必要があります。 • 重要な研究や医療判断には専門家のレビューが必要です。
ko: • 앱은 교육 및 연구 목적으로만 사용하세요. • NCBI 데이터는 학술 및 비상업적 용도로만 사용하세요. • 앱을 통해 얻은 정보의 정확성은 사용자가 직접 확인해야 합니다. • 중요한 연구나 의료 결정에는 전문가의 검토가 필요합니다.

# terms_section_6_title
source: App Updates & Support
ja: アプリの更新とサポート
ko: 앱 업데이트 및 지원

# terms_section_6_content
source: • App updates provided free of charge. • New features available without additional payment. • 30-day advance notice before app support discontinuation. • Not responsible for data loss due to support discontinuation.
ja: • アプリの更新は無料で提供されます。 • 新機能は追加支払いなしで利用できます。 • アプリサポート終了の30日前に事前通知します。 • サポート終了によるデータ損失については責任を負いません。
ko: • 앱 업데이트는 무료로 제공됩니다. • 새로운 기능을 추가 비용 없이 사용할 수 있습니다. • 앱 지원 중단 시 30일 전 사전 공지합니다. • 지원 중단으로 인한 데이터 손실에 대해 책임지지 않습니다.

# terms_section_7_title
source: Liability Limitation
ja: 責任の制限
ko: 책임의 제한

# terms_section_7_content
source: • DNA Viewer is provided "as is". • Developer not responsible for results from app usage. • NCBI guarantees accuracy of NCBI data. • Liability for app malfunction or data loss is limited.
ja: • DNA Viewerは「現状のまま」で提供されます。 • 開発者はアプリ使用による結果について責任を負いません。 • NCBIはNCBIデータの正確性を保証します。 • アプリの誤動作やデータ損失に対する責任は制限されます。
ko: • DNA Viewer는 "있는 그대로" 제공됩니다. • 앱 사용으로 인한 결과에 대해 개발자는 책임지지 않습니다. • NCBI 데이터의 정확성은 NCBI에서 보장합니다. • 앱 오작동이나 데이터 손실에 대한 책임은 제한적입니다.

# terms_section_8_title
source: Intellectual Property
ja: 知的財産権
ko: 지적 재산권

# terms_section_8_content
source: • Copyright of DNA Viewer app belongs to AVAS. • DNA sequence data is public data from NCBI. • App code provided under MIT license. • User-generated data belongs to user.
ja: • DNA Viewerアプリの著作権はAVASに帰属します。 • DNA配列データはNCBIからの公開データです。 • アプリコードはMITライセンスで提供されます。 • ユーザー生成データはユーザーに帰属します。
ko: • DNA Viewer 앱의 저작권은 AVAS에 있습니다. • DNA 시퀀스 데이터는 NCBI의 공개 데이터입니다. • 앱 코드는 MIT 라이센스로 제공됩니다. • 사용자가 생성한 데이터는 사용자의 소유입니다.

# terms_section_9_title
source: Terms Changes
ja: 規約の変更
ko: 약관 변경

# terms_section_9_content
source: Terms may change as needed, with notifications in app when changed. Last updated: October 20, 2025
ja: 規約は必要に応じて変更される場合があり、変更時はアプリ内で通知されます。最終更新日：2025年10月20日
ko: 이용약관은 필요에 따라 변경될 수 있으며, 변경 시 앱 내에서 공지합니다. 마지막 업데이트: 2025년 10월 20일

# license_permission_text
source: Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the "Software"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:
ko: 이 소프트웨어와 관련 문서 파일들("소프트웨어")의 사본을 얻은 모든 사람에게는 소프트웨어를 제한 없이 취급할 수 있는 권한이 무료로 부여됩니다. 여기에는 사용, 복사, 수정, 병합, 게시, 배포, 서브라이센스 및/또는 소프트웨어의 사본을 판매할 권리와 소프트웨어가 제공된 사람들이 그러할 수 있도록 허가하는 권리가 제한 없이 포함됩니다. 단, 다음 조건에 따릅니다:

# license_notice_text
source: The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.
ko: 위의 저작권 고지와 이 허가 고지는 소프트웨어의 모든 사본이나 중요한 부분에 포함되어야 합니다.

# license_warranty_text
source: THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
ko: 소프트웨어는 "있는 그대로" 제공되며, 상품성, 특정 목적에의 적합성 및 비침해에 대한 보증을 포함하되 이에 국한되지 않는 모든 종류의 명시적 또는 묵시적 보증 없이 제공됩니다. 어떤 경우에도 저자나 저작권 보유자는 계약 행위, 불법 행위 또는 기타 행위에서, 소프트웨어와 관련하여, 소프트웨어의 사용 또는 기타 거래에서 발생하는 청구, 손해 또는 기타 책임에 대해 책임지지 않습니다.

# license_open_source
source: Open Source Libraries
de: Open-Source-Bibliotheken
ja: オープンソースライブラリ
ko: 오픈소스 라이브러리

# license_app_info
source: App Information
de: App-Informationen
ja: アプリ情報
ko: 앱 정보

# license_app_name
source: App Name
ko: 앱 이름

# license_version
source: Version
ko: 버전

# license_build
source: Build
ko: 빌드

# license_platform
source: Platform
ko: 플랫폼

# license_last_update
source: Last Updated
ko: 마지막 업데이트

source: Done
de: Fertig
ja: 完了
ko: 완료

source: Close
de: Schließen
ja: 閉じる
ko: 닫기

source: Cancel
de: Abbrechen
ja: キャンセル
ko: 취소

source: OK
ko: 확인

source: Apply
de: Anwenden
ja: 適用
ko: 적용

source: Analyze
de: Analysieren
ja: 分析
ko: 분석

source: Digest
de: Verdauen
ja: 消化
ko: 절단

source: Show 3D
de: 3D anzeigen
ja: 3D表示
ko: 3D 보기

source: Show All
de: Alle anzeigen
ja: すべて表示
ko: 전체 보기

source: Show Less
de: Weniger anzeigen
ja: 簡略表示
ko: 간단히 보기

# analysis_title
source: Analysis
ko: 분석

# analysis_gc_title
source: GC Content Analysis
ko: GC 함량 분석

# analysis_gc_overall
source: Overall GC Content:
ko: 전체 GC 함량:

# analysis_gc_window_plot
source: GC Content Window Plot
ko: GC 함량 윈도우 플롯

# analysis_cpg_title
source: CpG Islands
ko: CpG 아일랜드

# analysis_cpg_none
source: No CpG islands found
ko: CpG 아일랜드를 찾을 수 없습니다

# analysis_cpg_island
source: CpG Island
ko: CpG 아일랜드

# analysis_cpg_position
source: Position:
ko: 위치:

# analysis_cpg_length
source: Length:
ko: 길이:

# analysis_cpg_ratio
source: CpG Ratio:
ko: CpG 비율:

# analysis_restriction_title
source: Restriction Sites Analysis
ko: 제한 효소 분석

# analysis_dna_sequence
source: DNA Sequence
ko: DNA 시퀀스

# analysis_restriction_sites
source: Restriction Sites
ko: 제한 효소 절단 부위

# analysis_restriction_paste
source: Paste a DNA sequence and tap Analyze.
ko: DNA 시퀀스를 붙여넣고 분석 버튼을 누르세요.

# analysis_analyzing
source: Analyzing restriction sites...
ko: 제한 효소 분석 중...

# analysis_protein_title
source: Protein Translation
ko: 단백질 번역

# analysis_protein_reading_frame
source: Reading Frame
ko: 리딩 프레임

# analysis_protein_amino_seq
source: Amino Acid Sequence
ko: 아미노산 서열

# analysis_protein_amino_acids
source: amino acids
ko: 개 아미노산

# analysis_protein_composition
source: Amino Acid Composition
ko: 아미노산 조성

# analysis_protein_orf_none
source: No ORFs found (minimum 75 bp)
ko: ORF를 찾을 수 없습니다 (최소 75 bp)

# analysis_protein_codon_detail
source: Codon Translation Details
ko: 코돈 번역 상세

# analysis_protein_codon_more
source: Show %d more codons
ko: %d개 더 보기

# analysis_protein_tap_expand
source: Tap to expand
ko: 펼치려면 탭하세요

# guide_getting_started_1_title
source: Basic DNA Sequence Viewing
de: Grundlegende DNA-Sequenzanzeige
ja: 基本DNA配列表示
ko: 기본 DNA 시퀀스 보기

# guide_getting_started_1_desc
source: A default DNA sequence (BRCA1) loads when the app starts. Drag to rotate, pinch to zoom in/out.
de: Beim App-Start wird eine Standard-DNA-Sequenz (BRCA1) geladen. Ziehen zum Drehen, Pinch zum Zoomen.
ja: アプリ起動時にデフォルトDNA配列（BRCA1）が読み込まれます。ドラッグで回転、ピンチでズームイン/アウトしてください。
ko: 앱 시작 시 기본 DNA 시퀀스(BRCA1)가 로드됩니다. 드래그로 회전, 핀치로 확대/축소하세요.

# guide_getting_started_2_title
source: Group-based Navigation
de: Gruppenbasierte Navigation
ja: グループ別ナビゲーション
ko: 그룹별 탐색

# guide_getting_started_2_desc
source: DNA is grouped in 100bp units. Use G1, G2, G3... buttons to move between sections.
de: DNA ist in 100bp-Einheiten gruppiert. Verwenden Sie G1, G2, G3...-Tasten zum Wechseln zwischen Abschnitten.
ja: DNAは100bp単位でグループ化されています。G1、G2、G3...ボタンでセクション間を移動してください。
ko: DNA는 100bp 단위로 그룹화됩니다. G1, G2, G3... 버튼으로 섹션을 이동하세요.

# guide_getting_started_3_title
source: Sequence Reading
de: Sequenz lesen
ja: 配列読み取り
ko: 시퀀스 읽기

# guide_getting_started_3_desc
source: Use the 'Sequence' button to display nucleotide sequences (A, T, G, C) at the bottom.
de: Verwenden Sie die 'Sequence'-Taste, um Nukleotidsequenzen (A, T, G, C) unten anzuzeigen.
ja: 'Sequence'ボタンで下部にヌクレオチド配列（A、T、G、C）を表示します。
ko: 'Sequence' 버튼으로 하단에 염기서열(A, T, G, C)을 표시합니다.

# guide_getting_started_4_title
source: 3D Style Changes
de: 3D-Stil ändern
ja: 3Dスタイル変更
ko: 3D 스타일 변경

# guide_getting_started_4_desc
source: Use the eye icon (👁) to select various 3D modes like Double Helix, Ladder, Ball & Stick.
de: Verwenden Sie das Augen-Symbol (👁), um verschiedene 3D-Modi wie Double Helix, Ladder, Ball & Stick auszuwählen.
ja: 目のアイコン（👁）でDouble Helix、Ladder、Ball & Stickなど様々な3Dモードを選択してください。
ko: 눈 아이콘(👁)으로 Double Helix, Ladder, Ball & Stick 등 다양한 3D 모드를 선택하세요.

# guide_gene_library_1_title
source: Open Library
de: Bibliothek öffnen
ja: ライブラリを開く
ko: 라이브러리 열기

# guide_gene_library_1_desc
source: Menu (☰) → Gene Library to explore genes from the NCBI database.
de: Menü (☰) → Gene Library, um Gene aus der NCBI-Datenbank zu erkunden.
ja: メニュー（☰）→ Gene LibraryでNCBIデータベースの遺伝子を探索してください。
ko: 메뉴(☰) → Gene Library로 NCBI 데이터베이스의 유전자를 탐색하세요.

# guide_gene_library_2_title
source: Category Search
de: Kategoriebasierte Suche
ja: カテゴリ別検索
ko: 카테고리별 검색

# guide_gene_library_2_desc
source: Filter by Organism, Gene Type, Chromosome, Status, Gene Family.
de: Filtern nach Organismus, Gen-Typ, Chromosom, Status, Genfamilie.
ja: Organism、Gene Type、Chromosome、Status、Gene Familyでフィルタリングしてください。
ko: Organism, Gene Type, Chromosome, Status, Gene Family로 필터링하세요.

# guide_gene_library_3_title
source: Apply Gene
de: Gen anwenden
ja: 遺伝子適用
ko: 유전자 적용

# guide_gene_library_3_desc
source: Select a gene and use 'Apply' to load its DNA sequence in 3D.
de: Wählen Sie ein Gen und verwenden Sie 'Apply', um seine DNA-Sequenz in 3D zu laden.
ja: 遺伝子を選択し、'Apply'でそのDNA配列を3Dで読み込みます。
ko: 유전자 선택 후 'Apply'로 해당 DNA 시퀀스를 3D로 로드합니다.

# guide_gene_library_4_title
source: Real-time Data
de: Echtzeitdaten
ja: リアルタイムデータ
ko: 실시간 데이터

# guide_gene_library_4_desc
source: All data is fetched from NCBI in real-time, ensuring it's always up-to-date.
de: Alle Daten werden in Echtzeit von NCBI abgerufen und sind daher immer aktuell.
ja: すべてのデータはNCBIからリアルタイムで取得されるため、常に最新です。
ko: 모든 데이터는 NCBI에서 실시간으로 가져오므로 항상 최신입니다.

# guide_analysis_tools_1_title
source: GC Content
de: GC-Gehalt
ja: GC含量
ko: GC 함량

# guide_analysis_tools_1_desc
source: Analyzes the ratio of guanine (G) and cytosine (C). High GC content indicates stable DNA.
de: Analysiert das Verhältnis von Guanin (G) und Cytosin (C). Hoher GC-Gehalt bedeutet stabile DNA.
ja: グアニン（G）とシトシン（C）の比率を解析します。高いGC含量は安定したDNAを示します。
ko: 구아닌(G)과 시토신(C) 염기의 비율을 분석합니다. 높은 GC 함량은 안정적인 DNA를 의미합니다.

# guide_analysis_tools_2_title
source: CpG Islands
de: CpG-Inseln
ja: CpGアイランド
ko: CpG 아일랜드

# guide_analysis_tools_2_desc
source: Detects regions with high CG frequency. Important for gene regulation.
de: Erkennt Regionen mit hoher CG-Häufigkeit. Wichtig für die Genregulation.
ja: CG頻度の高い領域を検出します。遺伝子調節に重要な役割を果たします。
ko: CG 빈도가 높은 영역을 탐지합니다. 유전자 조절에 중요한 역할을 합니다.

# guide_analysis_tools_3_title
source: Restriction Enzymes
de: Restriktionsenzyme
ja: 制限酵素
ko: 제한 효소

# guide_analysis_tools_3_desc
source: Analyzes enzymes that can cut DNA and identifies cutting positions.
de: Analysiert Enzyme, die DNA schneiden können, und identifiziert Schnittstellen.
ja: DNAを切断可能な酵素を解析し、切断位置を確認します。
ko: DNA 절단 가능한 효소들을 분석하고 절단 위치를 확인합니다.

# guide_analysis_tools_4_title
source: Protein Translation
de: Proteinübersetzung
ja: タンパク質翻訳
ko: 단백질 번역

# guide_analysis_tools_4_desc
source: Translates DNA to amino acids, finds ORFs, and analyzes amino acid composition.
de: Übersetzt DNA zu Aminosäuren, findet ORFs und analysiert Aminosäurezusammensetzung.
ja: DNAをアミノ酸に翻訳し、ORFを見つけ、アミノ酸組成を解析します。
ko: DNA를 아미노산으로 번역하고, ORF를 찾고, 아미노산 조성을 분석합니다.

# guide_restriction_enzymes_1_title
source: Enzyme Selection
de: Enzymauswahl
ja: 酵素選択
ko: 효소 선택

# guide_restriction_enzymes_1_desc
source: Use the Scissor button to see available restriction enzymes for the current sequence.
de: Verwenden Sie die Scissor-Taste, um verfügbare Restriktionsenzyme für die aktuelle Sequenz zu sehen.
ja: Scissorボタンで現在の配列に使用可能な制限酵素リストを確認してください。
ko: Scissor 버튼으로 현재 시퀀스에 사용 가능한 제한 효소 목록을 확인하세요.

# guide_restriction_enzymes_2_title
source: 3D Visualization
de: 3D-Visualisierung
ja: 3D可視化
ko: 3D 시각화

# guide_restriction_enzymes_2_desc
source: Use 'Show 3D' to display cutting positions as red markers in 3D.
de: Verwenden Sie 'Show 3D', um Schnittstellen als rote Marker in 3D anzuzeigen.
ja: 'Show 3D'で切断位置を3Dで赤いマーカーとして表示します。
ko: 'Show 3D'로 절단 위치를 3D에서 빨간 마커로 표시합니다.

# guide_restriction_enzymes_3_title
source: Virtual Digestion
de: Virtuelle Verdauung
ja: 仮想切断
ko: 가상 절단

# guide_restriction_enzymes_3_desc
source: Use the 'Digest' button to simulate DNA cutting and view fragments.
de: Verwenden Sie die 'Digest'-Taste, um DNA-Schnitt zu simulieren und Fragmente zu betrachten.
ja: 'Digest'ボタンでDNA切断をシミュレートし、断片を確認してください。
ko: 'Digest' 버튼으로 DNA 절단을 시뮬레이션하고 단편을 확인하세요.

# guide_restriction_enzymes_4_title
source: Educational Use
de: Bildungsnutzung
ja: 教育的活用
ko: 교육적 활용

# guide_restriction_enzymes_4_desc
source: Learn about each enzyme's recognition sequence and cutting patterns.
de: Lernen Sie die Erkennungssequenz und Schnittmuster jedes Enzyms.
ja: 各酵素の認識配列と切断パターンを学習できます。
ko: 각 효소의 인식 서열과 절단 패턴을 학습할 수 있습니다.

# guide_usage_tips_1_title
source: Rotation
de: Drehung
ja: 回転
ko: 회전

# guide_usage_tips_1_desc
source: Drag the 3D view to freely rotate the DNA structure.
de: Ziehen Sie die 3D-Ansicht, um die DNA-Struktur frei zu drehen.
ja: 3DビューをドラッグしてDNA構造を自由に回転させてください。
ko: 3D 뷰를 드래그하여 DNA 구조를 자유롭게 회전시키세요.

# guide_usage_tips_2_title
source: Zoom In/Out
de: Zoomen
ja: ズームイン/アウト
ko: 확대/축소

# guide_usage_tips_2_desc
source: Use pinch gestures to zoom in or out on the 3D structure.
de: Verwenden Sie Pinch-Gesten, um die 3D-Struktur zu vergrößern oder zu verkleinern.
ja: ピンチジェスチャーで3D構造を拡大または縮小してください。
ko: 핀치 제스처로 3D 구조를 확대하거나 축소하세요.

# guide_usage_tips_3_title
source: Auto Rotation
de: Automatische Drehung
ja: 自動回転
ko: 자동 회전

# guide_usage_tips_3_desc
source: Use the Rotation button to automatically rotate DNA 360 degrees.
de: Verwenden Sie die Rotation-Taste, um DNA automatisch 360 Grad zu drehen.
ja: RotationボタンでDNAを360度自動回転させます。
ko: Rotation 버튼으로 DNA를 360도 자동 회전시킵니다.

# guide_usage_tips_4_title
source: Reset View
de: Ansicht zurücksetzen
ja: ビューリセット
ko: 뷰 초기화

# guide_usage_tips_4_desc
source: Use the Reload button to reset the camera to its default position.
de: Verwenden Sie die Reload-Taste, um die Kamera auf ihre Standardposition zurückzusetzen.
ja: Reloadボタンでカメラをデフォルト位置にリセットします。
ko: Reload 버튼으로 카메라를 기본 위치로 재설정합니다.

# features_3d_viz_title
source: 3D DNA Visualization
de: 3D DNA-Visualisierung
ja: 3D DNA可視化
ko: 3D DNA 시각화

# features_3d_viz_1
source: High-quality 3D rendering based on SceneKit
de: Hochwertiges 3D-Rendering basierend auf SceneKit
ja: SceneKitベースの高品質3Dレンダリング
ko: SceneKit 기반 고품질 3D 렌더링

# features_3d_viz_2
source: Real-time interactive manipulation (rotation, zoom)
de: Echtzeit-interaktive Manipulation (Rotation, Zoom)
ja: リアルタイムインタラクティブ操作（回転、ズーム）
ko: 실시간 인터랙티브 조작 (회전, 확대/축소)

# features_3d_viz_3
source: Support for Double Helix, Ladder, Ball & Stick styles
de: Unterstützung für Double Helix, Ladder, Ball & Stick Stile
ja: Double Helix、Ladder、Ball & Stickスタイルサポート
ko: Double Helix, Ladder, Ball & Stick 스타일 지원

# features_3d_viz_4
source: Group-based sequence exploration (100bp units)
de: Gruppenbasierte Sequenzexploration (100bp-Einheiten)
ja: グループ別配列探索（100bp単位）
ko: 그룹별 염기서열 탐색 (100bp 단위)

# features_gene_lib_title
source: Gene Library
de: Genbibliothek
ja: 遺伝子ライブラリ
ko: 유전자 라이브러리

# features_gene_lib_1
source: Real-time NCBI database integration
de: Echtzeit-NCBI-Datenbankintegration
ja: NCBIデータベースリアルタイム連携
ko: NCBI 데이터베이스 실시간 연동

# features_gene_lib_2
source: Category-based gene search and filtering
de: Kategoriebasierte Gensuche und -filterung
ja: カテゴリ別遺伝子検索・フィルタリング
ko: 카테고리별 유전자 검색 및 필터링

# features_gene_lib_3
source: Classification by Organism, Gene Type, Chromosome, etc.
de: Klassifizierung nach Organismus, Gen-Typ, Chromosom, etc.
ja: Organism、Gene Type、Chromosome等分類
ko: Organism, Gene Type, Chromosome 등 분류

# features_gene_lib_4
source: Automatic FASTA format DNA sequence loading
de: Automatisches Laden von FASTA-format DNA-Sequenzen
ja: FASTA形式DNA配列自動ロード
ko: FASTA 형식 DNA 시퀀스 자동 로드

# features_analysis_title
source: Analysis Tools
de: Analysetools
ja: 解析ツール
ko: 분석 도구

# features_analysis_1
source: GC content analysis and window plots
de: GC-Gehalt-Analyse und Fenster-Plots
ja: GC含量解析・ウィンドウプロット
ko: GC 함량 분석 및 윈도우 플롯

# features_analysis_2
source: Automatic CpG island detection
de: Automatische CpG-Insel-Erkennung
ja: CpGアイランド自動検出
ko: CpG 아일랜드 자동 탐지

# features_analysis_3
source: Restriction enzyme cutting site analysis
de: Restriktionsenzym-Schnittstellenanalyse
ja: 制限酵素切断部位解析
ko: 제한 효소 절단 부위 분석

# features_analysis_4
source: DNA → protein translation (codon table)
de: DNA → Protein-Übersetzung (Codon-Tabelle)
ja: DNA → タンパク質翻訳（コドンテーブル）
ko: DNA → 단백질 번역 (코돈 테이블)

# features_analysis_5
source: Amino acid composition bar charts
de: Aminosäure-Zusammensetzungs-Balkendiagramme
ja: アミノ酸組成棒グラフ
ko: 아미노산 조성 막대그래프

# features_analysis_6
source: Open Reading Frame (ORF) detection
de: Open Reading Frame (ORF) Erkennung
ja: Open Reading Frame（ORF）検出
ko: Open Reading Frame (ORF) 탐지

# features_enzyme_title
source: Restriction Enzymes
de: Restriktionsenzyme
ja: 制限酵素
ko: 제한 효소

# features_enzyme_1
source: 200+ restriction enzyme database
de: 200+ Restriktionsenzym-Datenbank
ja: 200+制限酵素データベース
ko: 200+ 제한 효소 데이터베이스

# features_enzyme_2
source: IUPAC code support (regex conversion)
de: IUPAC-Code-Unterstützung (Regex-Konvertierung)
ja: IUPACコードサポート（正規表現変換）
ko: IUPAC 코드 지원 (정규표현식 변환)

# features_enzyme_3
source: 3D visualization of cutting positions (red markers)
de: 3D-Visualisierung von Schnittstellen (rote Marker)
ja: 切断位置3D可視化（赤マーカー）
ko: 절단 위치 3D 시각화 (빨간 마커)

# features_enzyme_4
source: SequenceBar scissors icon display
de: SequenceBar-Scheren-Symbol-Anzeige
ja: SequenceBar scissorsアイコン表示
ko: SequenceBar scissors 아이콘 표시

# features_enzyme_5
source: Virtual DNA cutting simulation
de: Virtuelle DNA-Schnitt-Simulation
ja: 仮想DNA切断シミュレーション
ko: 가상 DNA 절단 시뮬레이션

# features_enzyme_6
source: Educational Gel Electrophoresis visualization
de: Bildungs-Gel-Elektrophorese-Visualisierung
ja: 教育用Gel Electrophoresis可視化
ko: 교육용 Gel Electrophoresis 시각화

# features_color_title
source: Color Themes
de: Farbthemen
ja: カラーテーマ
ko: 색상 테마

# features_color_1
source: Classic, Vivid, Pastel, Neon themes
de: Classic, Vivid, Pastel, Neon-Themen
ja: Classic、Vivid、Pastel、Neonテーマ
ko: Classic, Vivid, Pastel, Neon 테마

# features_color_2
source: Base-specific color customization (A, T, G, C)
de: Basis-spezifische Farbanpassung (A, T, G, C)
ja: 塩基別カスタマイズ（A、T、G、C）
ko: 염기별 색상 커스터마이징 (A, T, G, C)

# features_color_3
source: Hydrogen bond color settings
de: Wasserstoffbrücken-Farbeinstellungen
ja: 水素結合カラー設定
ko: 수소 결합 색상 설정

# features_color_4
source: Real-time color changes and preview
de: Echtzeit-Farbänderungen und Vorschau
ja: リアルタイムカラー変更・プレビュー
ko: 실시간 색상 변경 및 미리보기

# features_interaction_title
source: Interaction Features
de: Interaktionsfunktionen
ja: インタラクション機能
ko: 인터랙션 기능

# features_interaction_1
source: Drag to rotate 3D models
de: Ziehen zum Drehen von 3D-Modellen
ja: ドラッグで3Dモデル回転
ko: 드래그로 3D 모델 회전

# features_interaction_2
source: Pinch gestures for zoom in/out
de: Pinch-Gesten zum Zoomen
ja: ピンチジェスチャーでズームイン/アウト
ko: 핀치 제스처로 확대/축소

# features_interaction_3
source: Automatic 360-degree rotation animation
de: Automatische 360-Grad-Rotationsanimation
ja: 自動360度回転アニメーション
ko: 자동 360도 회전 애니메이션

# features_interaction_4
source: Individual base selection and highlighting
de: Einzelne Basis-Auswahl und Hervorhebung
ja: 個別塩基選択・ハイライト
ko: 개별 염기 선택 및 하이라이트

# features_interaction_5
source: Group-based navigation
de: Gruppenbasierte Navigation
ja: グループ単位ナビゲーション
ko: 그룹 단위 네비게이션

# features_interaction_6
source: Reload to restore initial state
de: Reload zur Wiederherstellung des ursprünglichen Zustands
ja: Reloadで初期状態復元
ko: Reload로 초기 상태 복원

# features_performance_title
source: Performance Optimization
de: Leistungsoptimierung
ja: パフォーマンス最適化
ko: 성능 최적화

# features_performance_1
source: Memory efficiency through group-based loading
de: Speichereffizienz durch gruppenbasiertes Laden
ja: グループ単位ロードによるメモリ効率化
ko: 그룹 단위 로딩으로 메모리 효율화

# features_performance_2
source: Large DNA sequence processing capability
de: Große DNA-Sequenz-Verarbeitungsfähigkeit
ja: 大容量DNA配列処理可能
ko: 대용량 DNA 시퀀스 처리 가능

# features_performance_3
source: Background thread 3D rendering
de: Hintergrund-Thread-3D-Rendering
ja: バックグラウンドスレッド3Dレンダリング
ko: 백그라운드 스레드 3D 렌더링

# features_performance_4
source: Smart caching system
de: Intelligentes Caching-System
ja: スマートキャッシュシステム
ko: 스마트 캐싱 시스템

# features_performance_5
source: Automatic memory cleanup (autoreleasepool)
de: Automatische Speicherbereinigung (autoreleasepool)
ja: 自動メモリクリーンアップ（autoreleasepool）
ko: 자동 메모리 정리 (autoreleasepool)

# features_education_title
source: Educational Features
de: Bildungsfunktionen
ja: 教育機能
ko: 교육적 기능

# features_education_1
source: Molecular biology experiment simulation
de: Molekularbiologie-Experiment-Simulation
ja: 分子生物学実験シミュレーション
ko: 분자생물학 실험 시뮬레이션

# features_education_2
source: DNA cloning process visualization
de: DNA-Klonierungsprozess-Visualisierung
ja: DNAクローニングプロセス可視化
ko: DNA 클로닝 프로세스 시각화

# features_education_3
source: Gene transformation animation
de: Gen-Transformations-Animation
ja: 遺伝子変換アニメーション
ko: 유전자 변환 애니메이션

# features_education_4
source: Experimental verification process learning
de: Experimentelle Verifikationsprozess-Lernen
ja: 実験検証過程学習
ko: 실험 검증 과정 학습

# features_education_5
source: Detailed user guide provided
de: Detaillierte Benutzeranleitung bereitgestellt
ja: 詳細ユーザーガイド提供
ko: 상세한 사용 가이드 제공

# guide_usage_tips
source: 💡 Usage Tips
de: 💡 Nutzungstipps
ja: 💡 使用のコツ
